tap "blacktop/tap"
tap "grafana/grafana"
tap "grishka/grishka"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "oleiade/tap"
tap "pamburus/tap"
tap "powershell/tap"
tap "saulpw/vd"
tap "teamookla/speedtest"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Core application library for C
brew "glib"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# GNU binary tools for native development
brew "binutils"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# GNU debugger
brew "gdb"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Trim your git remote tracking branches that are merged or gone
brew "git-trim"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Library access to GnuPG
brew "gpgme"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Dex to Java decompiler
brew "jadx"
# JSON output from a shell
brew "jo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Library to render SVG files using Cairo
brew "librsvg"
# Next-gen compiler infrastructure
brew "llvm"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Web and API based SMTP testing
brew "mailpit"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Fast, highly customisable system info script
brew "neofetch"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Prometheus exporter for machine metrics
brew "node_exporter"
# Libraries for security-enabled client and server applications
brew "nss"
# Modern shell for the GitHub era
brew "nushell"
# Oracle Cloud Infrastructure CLI
brew "oci-cli"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Log file highlighter
brew "tailspin"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Ultra fast grep with query UI, fuzzy search, archive search, and more
brew "ugrep"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Personal information dashboard for your terminal
brew "wtfutil"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Organize Your macOS Launchpad Apps
brew "blacktop/tap/lporg"
# Vendor-agnostic OpenTelemetry Collector distribution with programmable pipelines
brew "grafana/grafana/alloy"
# Terraform
brew "hashicorp/tap/terraform"
# A simple and elegant password generator
brew "oleiade/tap/motus"
# Log viewer for JSON and logfmt logs
brew "pamburus/tap/hl"
# Formula to install PowerShell
brew "powershell/tap/powershell"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Command-line interface for 1Password
cask "1password-cli"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Android SDK component
cask "android-platform-tools"
# Open source, extensible AI agent that goes beyond code suggestions
cask "block-goose"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Audio tagger focusing on efficiency
cask "kid3"
# Web browser
cask "librewolf"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Control your tools with a few keystrokes
cask "raycast"
# Rust-based terminal
cask "warp"
vscode "1yib.rust-bundle"
vscode "adrianwilczynski.alpine-js-intellisense"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "astro-build.astro-vscode"
vscode "batisteo.vscode-django"
vscode "bbenoist.nix"
vscode "bbugh.change-color-format"
vscode "be5invis.toml"
vscode "bibhasdn.unique-lines"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "blockceptionltd.blockceptionvscodeminecraftbedrockdevelopmentextension"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "chrmarti.regex"
vscode "daltonmenezes.aura-theme"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "ddot.vscode-ast"
vscode "deerawan.vscode-dash"
vscode "deque-systems.vscode-axe-linter"
vscode "destruc7i0n.vscode-bedrock-definitions"
vscode "dnicolson.binary-plist"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "donjayamanne.typescript-notebook"
vscode "dracula-theme.theme-dracula"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esafirm.kotlin-formatter"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "flowtype.flow-for-vscode"
vscode "foam.foam-vscode"
vscode "formulahendry.dotnet"
vscode "foxundermoon.shell-format"
vscode "frhtylcn.pythonsnippets"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grafana.grafana-alloy"
vscode "grafana.grafana-vscode"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.debug-visualizer"
vscode "hugeblack.mcfdebugger"
vscode "icsharpcode.ilspy-vscode"
vscode "jannchie.codetime"
vscode "jebbs.markdown-extended"
vscode "jianbingfang.dupchecker"
vscode "johnpapa.vscode-peacock"
vscode "johnpapa.winteriscoming"
vscode "jsynowiec.vscode-insertdatestring"
vscode "juanblanco.solidity"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "khaeransori.json2csv"
vscode "levertion.mcjson"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "loyieking.smalise"
vscode "mathiasfrohlich.kotlin"
vscode "matthewpi.caddyfile-support"
vscode "maxmedia.go-prof"
vscode "maxvanderschee.web-accessibility"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "minecraftcommands.syntax-mcfunction"
vscode "misodee.vscode-nbt"
vscode "mohsen1.prettify-json"
vscode "mojang-studios.minecraft-debugger"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "oderwat.indent-rainbow"
vscode "ooooonly.smali2java"
vscode "oran9eutan.mcmodel-viewer"
vscode "orta.vscode-jest"
vscode "packdevutils.packdevutils"
vscode "pahimar.minecraft-essentials-extension-pack"
vscode "peterj.proto"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "ratquaza.recipe-creator"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "sdras.night-owl"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shengchen.vscode-checkstyle"
vscode "shiro.pythonpack"
vscode "slevesque.shader"
vscode "softwareape.numbermonger"
vscode "spgoding.datapack-language-server"
vscode "stevertus.mcscript"
vscode "streetsidesoftware.code-spell-checker"
vscode "strum355.vscode-mc-shader"
vscode "stylelint.vscode-stylelint"
vscode "surendrajat.apklab"
vscode "svelte.svelte-vscode"
vscode "swellaby.rust-pack"
vscode "tamasfe.even-better-toml"
vscode "tetradresearch.vscode-h2o"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "tintinweb.vscode-inline-bookmarks"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "waderyan.gitblame"
vscode "wakatime.vscode-wakatime"
vscode "wesbos.theme-cobalt2"
vscode "wholroyd.jinja"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
